app/controllers/friends_controller.rb

  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "Last_name", "email", "Phone", "DOB", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "first_name" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["first_name", "Sachin"], ["updated_at", "2022-04-24 10:13:42.944079"], ["id", 1]]